
import { defineStore } from 'pinia';

export const useCulturalInfoStore = defineStore('info', {
  state: () => ({

    data : [
        {
          id: 1,
          name: '凤麒麟纹石雕',
          era: '元',
          location_time: '1966年北京市桦皮厂西部明城墙基址出土啊实打实大苏打实打实大苏打',
          image: 'https://www.chnmuseum.cn/zp/zpml/csp/202111/P020220303332959841232.jpg',
          parameter: 'aaaaaa',
          category: '传世品',
          text: '1966年北京市桦皮厂西部明城墙基址出土1966年北京市桦皮厂西部明城墙基址出土1966年北京市桦皮厂西部明城墙基址出土1966年北京市桦皮厂西部明城墙基址出土1966年北京市桦皮厂西部明城墙基址出土1966年北京市桦皮厂西部明城墙基址出土1966年北京市桦皮厂西部明城墙基址出土1966年北京市桦皮厂西部明城墙基址出土1966年北京市桦皮厂西部明城墙基址出土1966年北京市桦皮厂西部明城墙基址出土1966年北京市桦皮厂西部明城墙基址出土1966年北京市桦皮厂西部明城墙基址出土1966年北京市桦皮厂西部明城墙基址出土1966年北京市桦皮厂西部明城墙基址出土',
        },
        {
          id: 2,
          name: '窑白釉龙纹瓷盘',
          era: '金',
          location_time: '1985年吉林农安县城北金代窖藏出土',
          image: '/assets/list/list2.jpg',
          parameter: 'aaaaaa',
          category: '传世品',
          text: '1985年吉林农安县城北金代窖藏出土1985年吉林农安县城北金代窖藏出土1985年吉林农安县城北金代窖藏出土1985年吉林农安县城北金代窖藏出土1985年吉林农安县城北金代窖藏出土1985年吉林农安县城北金代窖藏出土1985年吉林农安县城北金代窖藏出土1985年吉林农安县城北金代窖藏出土1985年吉林农安县城北金代窖藏出土1985年吉林农安县城北金代窖藏出土1985年吉林农安县城北金代窖藏出土',
        },
        {
          id: 3,
          name: '窑白釉龙纹瓷盘',
          era: '金',
          location_time: '1985年吉林农安县城北金代窖藏出土',
          image: '/assets/list/list2.jpg',
          parameter: 'aaaaaa',
          category: '货币',
          text: '1985年吉林农安县城北金代窖藏出土1985年吉林农安县城北金代窖藏出土1985年吉林农安县城北金代窖藏出土1985年吉林农安县城北金代窖藏出土1985年吉林农安县城北金代窖藏出土1985年吉林农安县城北金代窖藏出土1985年吉林农安县城北金代窖藏出土1985年吉林农安县城北金代窖藏出土1985年吉林农安县城北金代窖藏出土1985年吉林农安县城北金代窖藏出土1985年吉林农安县城北金代窖藏出土1985年吉林农安县城北金代窖藏出土1985年吉林农安县城北金代窖藏出土1985年吉林农安县城北金代窖藏出土1985年吉林农安县城北金代窖藏出土1985年吉林农安县城北金代窖藏出土1985年吉林农安县城北金代窖藏出土1985年吉林农安县城北金代窖藏出土',
        },
        {
          id: 4,
          name: '青铜剑',
          era: '秦',
          location_time: '1974年陕西临潼泰兵马俑坑出 ',
          image: '/assets/list/list3.jpg',
          parameter: 'aaaaaa',
          category: '艺术品',
          text: '1974年陕西临潼泰兵马俑坑出1974年陕西临潼泰兵马俑坑出1974年陕西临潼泰兵马俑坑出1974年陕西临潼泰兵马俑坑出1974年陕西临潼泰兵马俑坑出1974年陕西临潼泰兵马俑坑出1974年陕西临潼泰兵马俑坑出1974年陕西临潼泰兵马俑坑出1974年陕西临潼泰兵马俑坑出1974年陕西临潼泰兵马俑坑出1974年陕西临潼泰兵马俑坑出1974年陕西临潼泰兵马俑坑出',
        },
        {
          id: 5,
          name: '青铜剑',
          era: '秦',
          location_time: '1974年陕西临潼泰兵马俑坑出 ',
          image: '/assets/list/list3.jpg',
          parameter: 'aaaaaa',
          category: '艺术品',
          text: '1974年陕西临潼泰兵马俑坑出1974年陕西临潼泰兵马俑坑出1974年陕西临潼泰兵马俑坑出1974年陕西临潼泰兵马俑坑出1974年陕西临潼泰兵马俑坑出1974年陕西临潼泰兵马俑坑出1974年陕西临潼泰兵马俑坑出1974年陕西临潼泰兵马俑坑出1974年陕西临潼泰兵马俑坑出1974年陕西临潼泰兵马俑坑出1974年陕西临潼泰兵马俑坑出1974年陕西临潼泰兵马俑坑出',
        },
      ]


  }),
  actions: {

  }
});